esden/stm32cube-database/db/mcu/memory/STM32_DIE01E_64_256.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32WB0-256K" Dvendor="STMicroelectronics:13" info="ARM Cortex-M0+, 64 KB RAM, 256 KB FLASH">
    <package info="STMicroelectronics STM32WB0 Series Device Support" name="STM32WB0xx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="64000000" Dcore="ARM Cortex-M0+" DcoreVersion="r0_p1" Ddsp="DSP" Dendian="Little-endian" DnumInterrupts="83" DnumMpuRegions="8" SubRegions="8"/>
  </device>

  <resources>

    <memories>
      <memory access="rx" info="ROM memory" name="REGION_ROM" size="0x00001800" start="0x10000000" type="ROM"/>
      <memory access="rx" info="Flash memory" name="Flash" size="0x00040000" start="0x10040000" type="ROM"/>

      <memory access="rwx" info="SRAM0" name="SRAM0" size="0x00004000" start="0x20000000" type="RAM"/>
      <memory access="rwx" info="SRAM1" name="SRAM1" size="0x00004000" start="0x20004000" type="RAM"/>
      <memory access="rwx" info="SRAM2" name="SRAM2" size="0x00004000" start="0x20008000" type="RAM"/>
      <memory access="rwx" info="SRAM3" name="SRAM3" size="0x00004000" start="0x2000C000" type="RAM"/>
    </memories>

   </resources>

</rzone>
